export const NOTIFICATION_TITLES = [
  "זמן למשהו חלבי!",
  "אוראו זה פרווה או חלבי?",
  "אתם כבר לא בשריים!",
  "הידעת?",
  "איך שהזמן עובר מהר",
  "מישהו מחכה לכם",
  "הגיע הזמן",
  "קחו פסק זמן",
];

export const NOTIFICATION_BODIES = [
  "פתאום מתחשק לי מילקי...",
  "זה כבר לא משנה - כי אתם כבר לא בשריים!",
  "זמן לאיזה קפה קטן עם חלב!",
  "כשמישהו לא בשרי (כמוכם, עכשיו) הוא יכול לאכול גלידה שהיא לא סורבה.",
  "נכון לא שמתם לב שאתם כבר לא בשריים? גם אנחנו. כמעט שכחנו לשלוח לכם את ההודעה הזאת.",
  "אפשר לאכול מה שרוצים (כל עוד זה חלבי)",
  "זה כנראה החטיף או המשהו החלבי ששמרתם בצד למתי שכבר לא תהיו בשריים. יאללה, תתפרעו",
  "לבדוק אם הגלידה (החלבית, כמובן) עדיין במקפיא ולפנק את עצמכם",
  "ליטרלי. אתם עכשיו יכולים",
];

export const getRandomNotification = (index: number) => ({
  title: NOTIFICATION_TITLES[index],
  body: NOTIFICATION_BODIES[index],
}); 